УТ_для_edt/src/Documents/ТелефонныйЗвонок/ТелефонныйЗвонок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТелефонныйЗвонок</name>
  <basedOn>Document.Встреча</basedOn>
  <basedOn>Document.ТелефонныйЗвонок</basedOn>
  <basedOn>Document.ЭлектронноеПисьмоВходящее</basedOn>
  <basedOn>Document.ЭлектронноеПисьмоИсходящее</basedOn>
  <basedOn>Document.ЗапланированноеВзаимодействие</basedOn>
  <basedOn>Document.СообщениеSMS</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>АбонентКакСвязаться</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АбонентКонтакт</name>
    <type>
      <types>DefinedType.сфпКонтактВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>АбонентПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВариантыВажностиВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>Входящий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВзаимодействиеОснование</name>
    <type>
      <types>DocumentRef.CRM_Интерес</types>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>DocumentRef.ЗапланированноеВзаимодействие</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.ТелефонныйЗвонок</types>
      <types>DocumentRef.CRM_Телемаркетинг</types>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>DocumentRef.CRM_Заявка</types>
      <types>DocumentRef.удалитьCRM_Мероприятие</types>
      <types>DocumentRef.Встреча</types>
      <types>BusinessProcessRef.CRM_БизнесПроцесс</types>
      <types>DocumentRef.УдалитьCRM_Сделка</types>
      <types>DocumentRef.СообщениеSMS</types>
      <types>DocumentRef.УдалитьCRM_Событие</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СкрытьВАРМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>сфпCoMagicID</name>
    <comment>Идентификатор контакта в системе CoMagic</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>сфпДлительностьЗвонка</name>
    <comment>Длительность звонка в секундах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>сфпИдентификаторЗаписи</name>
    <comment>Идентификатор записи</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>сфпИдентификаторЗвонка</name>
    <comment>Идентификатор звонка</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>сфпСостояниеЗвонка</name>
    <comment>Состояние звонка</comment>
    <type>
      <types>EnumRef.сфпСостоянияЗвонков</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РольОтветственного</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>сфпПерезвонили</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>сфпРасшифровкаРазговора</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>смартЗагруженИзАТС</name>
    <comment>#1359 смарт: Лопато 13.09.2023 //Доработать регистрацию звонков в 1С (интеграция с ВАТС и Asterisk)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартВидАТС</name>
    <comment>#1359 смарт: Лопато 02.02.2024 //Доработать регистрацию звонков в 1С (интеграция с ВАТС и Asterisk)</comment>
    <type>
      <types>CatalogRef.смартВидыАТС</types>
    </type>
  </attributes>
  <attributes>
    <name>смартДлительностьОжиданияЗвонка</name>
    <comment>#1359 смарт: Лопато 02.02.2024 //Доработать регистрацию звонков в 1С (интеграция с ВАТС и Asterisk)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартДлительностьЗвонка</name>
    <comment>#1359 смарт: Лопато 02.02.2024 //Доработать регистрацию звонков в 1С (интеграция с ВАТС и Asterisk)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартПолученныеДаныеОтАТС</name>
    <comment>#1359 смарт: Лопато 02.02.2024 //Доработать регистрацию звонков в 1С (интеграция с ВАТС и Asterisk)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>смартИдентификаторIMOT</name>
    <comment>#1660 смарт: Лопато 06.03.2024 //Телефония. Выгрузка телефонных переговоров в Речевую аналитику imot.io</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартИдентификаторDeeray</name>
    <comment>#Б-2930 смарт: Лопато 10.04.2025 //Интеграция с Deeray. Выгрузка данных о звонках.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>НаборыЗначенийДоступа</name>
    <attributes>
      <name>НомерНабора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>DefinedType.ЗначениеДоступа</types>
      </type>
    </attributes>
    <attributes>
      <name>Уточнение</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/InformationRegisters/CRM_СостоянияЛидов/CRM_СостоянияЛидов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_СостоянияЛидов</name>
  <comment>АПК:265 не проверять на орфографию имя</comment>
  <resources>
    <name>Состояние</name>
    <type>
      <types>CatalogRef.CRM_СостоянияЛидов</types>
    </type>
  </resources>
  <resources>
    <name>СконвертированВОбъект</name>
    <comment>АПК:1032 АПК:265 не проверять на орфографию синоним и имя</comment>
    <type>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>BusinessProcessRef.CRM_БизнесПроцесс</types>
      <types>DocumentRef</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СвязанСКлиентом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КаналПолучения</name>
    <type>
      <types>CatalogRef.CRM_ИсточникиПолученияЛидов</types>
      <types>CatalogRef.CRM_УчетныеЗаписиМессенджеров</types>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКанала</name>
    <type>
      <types>EnumRef.CRM_ВидыКаналовПоступленияОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтклонения</name>
    <type>
      <types>CatalogRef.CRM_ПричиныОтклоненияОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаОбработку</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПричинаОтклонения</name>
    <type>
      <types>CatalogRef.CRM_ПричиныОтказаПоИнтересам</types>
    </type>
  </attributes>
  <dimensions>
    <name>Лид</name>
    <type>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>CatalogRef.CRM_Диалоги</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.ТелефонныйЗвонок</types>
      <types>DocumentRef.CRM_Заявка</types>
      <types>DocumentRef.CRM_СообщениеМессенджера</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/сфпИсторияЗвонков/сфпИсторияЗвонков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>сфпИсторияЗвонков</name>
  <comment>История звонков СофтФон</comment>
  <resources>
    <name>ВнутреннийНомер</name>
    <comment>Внутренний номер</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Входящий</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <comment>Дата окончания звонка</comment>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОтвета</name>
    <comment>Дата ответа на звонок</comment>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторЗаписи</name>
    <comment>Идентификатор записи</comment>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторЗвонка</name>
    <comment>Идентификатор звонка</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АбонентКонтакт</name>
    <type>
      <types>DefinedType.сфпКонтактВзаимодействия</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <dimensions>
    <name>ДатаНачала</name>
    <comment>Дата начала звонка</comment>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерТелефона</name>
    <comment>Номер телефона</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Звонок</name>
    <comment>Телефонный звонок</comment>
    <type>
      <types>DocumentRef.ТелефонныйЗвонок</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/сфпРечеваяАналитика/сфпРечеваяАналитика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>сфпРечеваяАналитика</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СтопСлова</name>
    <comment>Стоп-слова на которые сработала тематика</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Звонок</name>
    <type>
      <types>DocumentRef.ТелефонныйЗвонок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тематика</name>
    <type>
      <types>CatalogRef.сфпТематикиРечевойАналитики</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/ИсточникиПервичногоИнтереса/ИсточникиПервичногоИнтереса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсточникиПервичногоИнтереса</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>КаналПервичногоИнтереса</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.КаналыРекламныхВоздействий</types>
    </type>
  </resources>
  <resources>
    <name>ИсточникПервичногоИнтереса</name>
    <type>
      <types>CatalogRef.МаркетинговыеМероприятия</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>CRM_Сайт</name>
    <type>
      <types>CatalogRef.CRM_Сайты</types>
    </type>
  </resources>
  <resources>
    <name>CRM_UTM_source</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>CRM_UTM_medium</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>CRM_UTM_pos</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сделка</name>
    <type>
      <types>DocumentRef.CRM_Интерес</types>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.ТелефонныйЗвонок</types>
      <types>DocumentRef.CRM_Заявка</types>
      <types>DocumentRef.УдалитьCRM_Сделка</types>
      <types>CatalogRef.СделкиСКлиентами</types>
      <types>DocumentRef.УдалитьCRM_Событие</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.CRM_ПотенциальныеКлиенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/сфпСостоянияЗвонков/сфпСостоянияЗвонков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>сфпСостоянияЗвонков</name>
  <comment>Состояния звонков СофтФон</comment>
  <enumValues>
    <name>Отвеченный</name>
    <comment>На звонок ответили</comment>
  </enumValues>
  <enumValues>
    <name>Пропущенный</name>
    <comment>На звонок не ответили</comment>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Documents/ТелефонныйЗвонок/Forms/сфпФормаДокумента/Module.bsl
#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ.

&НаСервере
Процедура ЗаполнитьНаОснованииУчастника(ДанныеУчастника)
	
	Объект.АбонентКонтакт = ДанныеУчастника.Контакт;
	Если ПустаяСтрока(ДанныеУчастника.КакСвязаться) Тогда
		
		Объект.АбонентКакСвязаться = "";
		Взаимодействия.ДозаполнитьПоляКонтактов(Объект.АбонентКонтакт,
			Объект.АбонентПредставление,
			Объект.АбонентКакСвязаться,
			Перечисления.ТипыКонтактнойИнформации.Телефон);
		
	Иначе
		
		Объект.АбонентКакСвязаться = ДанныеУчастника.КакСвязаться;
		
	КонецЕсли;
	
	Объект.АбонентПредставление = ДанныеУчастника.Представление;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииИПриЧтенииНаСервере()

	Если НЕ Объект.Ссылка.Пустая() Тогда
		Взаимодействия.УстановитьРеквизитыФормыВзаимодействияПоДаннымРегистра(ЭтотОбъект);

	Иначе
		ИзменилисьКонтакты = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
// Процедура пытается найти контакт по ID CoMagic и заполнить в Событии.
//
// Параметры:
//	Нет.
//
Процедура сфпЗаполнитьПартнераИКонтактноеЛицоИзCoMagic()
	Контакт = сфпСофтФонПроСервер.сфпНайтиКонтактПоIDИзCoMagic(сфпСтруктураВнешнихДанных.comagic_context.visitor_id);
	Если ЗначениеЗаполнено(Контакт) Тогда
		Объект.АбонентКонтакт = Контакт.Ссылка;
	КонецЕсли;
КонецПроцедуры // сфпЗаполнитьПартнераИКонтактноеЛицоИзCoMagic()	

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствамиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеСвойствамиКлиент");
		МодульУправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствамиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеСвойствамиКлиент");
		МодульУправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

&НаСервере
// Процедура вычисляет владельца контакта и отображает его в форме документа
//
Процедура сфпЗаполнитьВладельцаКонтакта()
	
	Если ЗначениеЗаполнено(Объект.АбонентКонтакт) Тогда
		ИмяМетаданных = Объект.АбонентКонтакт.Метаданные().Имя;
		Если ИмяМетаданных = "КонтактныеЛица" ИЛИ ИмяМетаданных = "КонтактныеЛицаПартнеров" Тогда
			//Элементы.сфпВладелец.Видимость = Истина;
			//Элементы.сфпБизнесРегион_GMT.Видимость = Истина;
			
			УстановитьПривилегированныйРежим(Истина);
			сфпВладелец = Объект.АбонентКонтакт.Владелец;
			УстановитьПривилегированныйРежим(Ложь);
		ИначеЕсли ИмяМетаданных = "Партнеры" Тогда
			УстановитьПривилегированныйРежим(Истина);
			сфпВладелец = Объект.АбонентКонтакт;
			УстановитьПривилегированныйРежим(Ложь);
		Иначе	
			УстановитьПривилегированныйРежим(Истина);
			сфпВладелец = Справочники.Партнеры.ПустаяСсылка();
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
// Процедура добавляет номер телефона из поля "Как связаться" в объект из поля "Контакт"
//
//   Параметры:
//    СсылкаКИ 		- СправочникСсылка 	- Объект, к которому добавляется телефон
//	  НомерТелефона - Строка			- Добавляемый номер телефона
//
Процедура ДобавитьТелефонНаСервер(СсылкаКИ, НомерТелефона)
	ОбъектКИ = СсылкаКИ.ПолучитьОбъект();
	НомерТелефона = СокрЛП(НомерТелефона);
	Если ТипЗнч(СсылкаКИ) = Тип("СправочникСсылка.Партнеры") Тогда
		СтруктураНомера	= сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(НомерТелефона);
		Телефон = сфпСофтФонПроСервер.сфпУбратьИзНомераТелефонаВсеПрефиксы(НомерТелефона);
		НоваяКИ = ОбъектКИ.КонтактнаяИнформация.Добавить();
		НоваяКИ.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон");
		Если ОбъектКИ.ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.Компания Тогда
			НоваяКИ.Вид	= Справочники.ВидыКонтактнойИнформации.ТелефонПартнера;
		ИначеЕсли Найти(СтруктураНомера.КодГорода, "9") = 1 Тогда
			НоваяКИ.Вид	= Справочники.ВидыКонтактнойИнформации.CRM_МобильныйТелефонЧастногоЛица;
		Иначе	
			НоваяКИ.Вид	= Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица;
		КонецЕсли;	
		НоваяКИ.НомерТелефонаБезКодов	= СтруктураНомера.НомерТелефона;		
		Если ЗначениеЗаполнено(СтруктураНомера.КодГорода) Тогда
			НоваяКИ.Представление	= ?(ЗначениеЗаполнено(СтруктураНомера.КодСтраны),СтруктураНомера.КодСтраны + " (", "(") + СтруктураНомера.КодГорода + ") " + СтруктураНомера.НомерТелефона;
		Иначе	
			НоваяКИ.Представление	= Телефон;
		КонецЕсли;	
		НоваяКИ.НомерТелефона = Телефон;		
		ЗначенияПолей	= Новый СписокЗначений;
		ЗначенияПолей.Добавить(СтруктураНомера.КодСтраны,		"КодСтраны");
		ЗначенияПолей.Добавить(СтруктураНомера.КодГорода,		"КодГорода");
		ЗначенияПолей.Добавить(СтруктураНомера.НомерТелефона,	"НомерТелефона");
		НоваяКИ.ЗначенияПолей	= ЗначенияПолей;		
		ОбъектКИ.Записать();
	ИначеЕсли ТипЗнч(СсылкаКИ) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда		
		СтруктураНомера	= сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(НомерТелефона);		
		Телефон = сфпСофтФонПроСервер.сфпУбратьИзНомераТелефонаВсеПрефиксы(НомерТелефона);	
		НоваяКИ = ОбъектКИ.КонтактнаяИнформация.Добавить();
		НоваяКИ.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон");
		Если Найти(СтруктураНомера.КодГорода, "9") = 1 Тогда
			НоваяКИ.Вид = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица");
		Иначе	
			НоваяКИ.Вид = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица");
		КонецЕсли;			
		НоваяКИ.НомерТелефонаБезКодов	= СтруктураНомера.НомерТелефона;		
		Если ЗначениеЗаполнено(СтруктураНомера.КодГорода) Тогда
			НоваяКИ.Представление	= ?(ЗначениеЗаполнено(СтруктураНомера.КодСтраны),СтруктураНомера.КодСтраны + " (", "(") + СтруктураНомера.КодГорода + ") " + СтруктураНомера.НомерТелефона;
		Иначе	
			НоваяКИ.Представление	= Телефон;
		КонецЕсли;	
		НоваяКИ.НомерТелефона = Телефон;		
		ЗначенияПолей	= Новый СписокЗначений;
		ЗначенияПолей.Добавить(СтруктураНомера.КодСтраны,		"КодСтраны");
		ЗначенияПолей.Добавить(СтруктураНомера.КодГорода,		"КодГорода");
		ЗначенияПолей.Добавить(СтруктураНомера.НомерТелефона,	"НомерТелефона");
		НоваяКИ.ЗначенияПолей	= ЗначенияПолей;				
		ОбъектКИ.Записать();		
	ИначеЕсли ТипЗнч(СсылкаКИ) = Тип("СправочникСсылка.CRM_ПотенциальныеКлиенты") Тогда				
		СтруктураНомера	= сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(НомерТелефона);		
		Телефон = сфпСофтФонПроСервер.сфпУбратьИзНомераТелефонаВсеПрефиксы(НомерТелефона);	
		НоваяКИ = ОбъектКИ.КонтактнаяИнформация.Добавить();
		НоваяКИ.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон");
		НоваяКИ.Вид = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.CRM_ТелефонПотенциальногоКлиента");
		НоваяКИ.НомерТелефонаБезКодов	= СтруктураНомера.НомерТелефона;		
		Если ЗначениеЗаполнено(СтруктураНомера.КодГорода) Тогда
			НоваяКИ.Представление	= ?(ЗначениеЗаполнено(СтруктураНомера.КодСтраны),СтруктураНомера.КодСтраны + " (", "(") + СтруктураНомера.КодГорода + ") " + СтруктураНомера.НомерТелефона;
		Иначе	
			НоваяКИ.Представление	= Телефон;
		КонецЕсли;	
		НоваяКИ.НомерТелефона = Телефон;
		ЗначенияПолей	= Новый СписокЗначений;
		ЗначенияПолей.Добавить(СтруктураНомера.КодСтраны,		"КодСтраны");
		ЗначенияПолей.Добавить(СтруктураНомера.КодГорода,		"КодГорода");
		ЗначенияПолей.Добавить(СтруктураНомера.НомерТелефона,	"НомерТелефона");
		НоваяКИ.ЗначенияПолей	= ЗначенияПолей;				
		ОбъектКИ.Записать();		
	ИначеЕсли ТипЗнч(СсылкаКИ) = Тип("СправочникСсылка.ФизическиеЛица") Тогда						
		СтруктураНомера	= сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(НомерТелефона);		
		Телефон = сфпСофтФонПроСервер.сфпУбратьИзНомераТелефонаВсеПрефиксы(НомерТелефона);	
		НоваяКИ = ОбъектКИ.КонтактнаяИнформация.Добавить();
		НоваяКИ.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон");
		Если Найти(СтруктураНомера.КодГорода, "9") = 1 Тогда
			НоваяКИ.Вид = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица");
		Иначе	
			НоваяКИ.Вид = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонДомашнийФизическиеЛица");
		КонецЕсли;			
		НоваяКИ.НомерТелефонаБезКодов	= СтруктураНомера.НомерТелефона;		
		Если ЗначениеЗаполнено(СтруктураНомера.КодГорода) Тогда
			НоваяКИ.Представление	= ?(ЗначениеЗаполнено(СтруктураНомера.КодСтраны),СтруктураНомера.КодСтраны + " (", "(") + СтруктураНомера.КодГорода + ") " + СтруктураНомера.НомерТелефона;
		Иначе	
			НоваяКИ.Представление	= Телефон;
		КонецЕсли;	
		НоваяКИ.НомерТелефона = Телефон;		
		ЗначенияПолей	= Новый СписокЗначений;
		ЗначенияПолей.Добавить(СтруктураНомера.КодСтраны,		"КодСтраны");
		ЗначенияПолей.Добавить(СтруктураНомера.КодГорода,		"КодГорода");
		ЗначенияПолей.Добавить(СтруктураНомера.НомерТелефона,	"НомерТелефона");
		НоваяКИ.ЗначенияПолей	= ЗначенияПолей;				
		ОбъектКИ.Записать();		
	ИначеЕсли ТипЗнч(СсылкаКИ) = Тип("СправочникСсылка.Пользователи") Тогда								
		СтруктураНомера	= сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(НомерТелефона);		
		Телефон = сфпСофтФонПроСервер.сфпУбратьИзНомераТелефонаВсеПрефиксы(НомерТелефона);
		НоваяКИ = ОбъектКИ.КонтактнаяИнформация.Добавить();
		НоваяКИ.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон");
		Если Найти(СтруктураНомера.КодГорода, "9") = 1 Тогда
			НоваяКИ.Вид = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонПользователя");
		Иначе	
			НоваяКИ.Вид = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.CRM_ТелефонПользователяРабочий");
		КонецЕсли;		
		НоваяКИ.НомерТелефонаБезКодов	= СтруктураНомера.НомерТелефона;		
		Если ЗначениеЗаполнено(СтруктураНомера.КодГорода) Тогда
			НоваяКИ.Представление	= ?(ЗначениеЗаполнено(СтруктураНомера.КодСтраны),СтруктураНомера.КодСтраны + " (", "(") + СтруктураНомера.КодГорода + ") " + СтруктураНомера.НомерТелефона;
		Иначе	
			НоваяКИ.Представление	= Телефон;
		КонецЕсли;	
		НоваяКИ.НомерТелефона = Телефон;		
		ЗначенияПолей	= Новый СписокЗначений;
		ЗначенияПолей.Добавить(СтруктураНомера.КодСтраны,		"КодСтраны");
		ЗначенияПолей.Добавить(СтруктураНомера.КодГорода,		"КодГорода");
		ЗначенияПолей.Добавить(СтруктураНомера.НомерТелефона,	"НомерТелефона");
		НоваяКИ.ЗначенияПолей	= ЗначенияПолей;				
		ОбъектКИ.Записать();		
	КонецЕсли;
КонецПроцедуры	

&НаСервере
Процедура сфпРазрешеныИзмененияВДокументе()
	ТекПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	Если ТекПользователь <> Объект.Ответственный И Не Пользователи.РолиДоступны("ПолныеПрава, сфпУправлениеМаршрутизацией")
		И НЕ CRM_БизнесПроцессыСервер.ПользовательУчастникРоли(ТекПользователь, Объект.CRM_РольОтветственного) Тогда
		ТолькоПросмотр = Истина;
		Элементы.ОбщаяКомандаCRM_УстановитьНовогоОтветственного.Доступность = Ложь;
		Элементы.ПеренаправитьНаРоль.Доступность = Ложь;
		Элементы.ГруппаКомандаОтменитьОтклонение.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

// +CRM
&НаСервере
Процедура НеобходимыеДействияПриСозданииНаСервереЧтенииНаСервере()
	
	// Определить канал и источник первичного интереса.
	Если ПолучитьФункциональнуюОпцию("ФиксироватьПервичныйИнтерес") Тогда
		Если НЕ Объект.Ссылка.Пустая() Тогда
			
			Интерес = CRM_МаркетингСервер.ПолучитьПервичныйИнтерес(Объект.Дата,Объект.Ссылка,сфпВладелец);
			
			КаналПервичногоИнтереса    = Интерес.КаналПервичногоИнтереса;
			ИсточникПервичногоИнтереса = Интерес.ИсточникПервичногоИнтереса;
			//Элементы.ИсточникПервичногоИнтереса.ТолькоПросмотр = НЕ ЗначениеЗаполнено(КаналПервичногоИнтереса);
			
		КонецЕсли;
	Иначе
		Элементы.ГруппаПервичныйИнтерес.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступностьПервичногоИнтереса()
	
	Актуальность = Ложь;
	ПредыдущийИсточник = Неопределено;
	
	Попытка
		ПредыдущийИсточник = ПервичныйИнтерес.Получить(0);
	Исключение КонецПопытки;
	Если ПредыдущийИсточник <> Неопределено Тогда
		Актуальность = ПредыдущийИсточник.Актуальность;
	КонецЕсли;
	
	пПартнер = сфпВладелец;
	
	Если Актуальность = Истина И НЕ ЗначениеЗаполнено(КаналПервичногоИнтереса) Тогда
		Элементы.КаналПервичногоИнтереса.АвтоОтметкаНезаполненного = Ложь;
		Элементы.КаналПервичногоИнтереса.ОтметкаНезаполненного = Ложь;
	
	ИначеЕсли Актуальность = Ложь И НЕ ЗначениеЗаполнено(КаналПервичногоИнтереса) Тогда
		Элементы.КаналПервичногоИнтереса.АвтоОтметкаНезаполненного = ЗаполнятьПервичныйИнтерес;
		Элементы.КаналПервичногоИнтереса.ОтметкаНезаполненного = ЗаполнятьПервичныйИнтерес;
	КонецЕсли;
	
	Если Элементы.ИсточникПервичногоИнтереса.Доступность И ЗначениеЗаполнено(КаналПервичногоИнтереса) Тогда
		Если ТипПВХ(КаналПервичногоИнтереса) = Тип("ПеречислениеСсылка.CRM_КаналыБезУказанияИсточника") Тогда
			Элементы.ИсточникПервичногоИнтереса.АвтоОтметкаНезаполненного = Ложь;
			Элементы.ИсточникПервичногоИнтереса.ОтметкаНезаполненного = Ложь;
			
		Иначе
			Элементы.ИсточникПервичногоИнтереса.АвтоОтметкаНезаполненного = НЕ ЗначениеЗаполнено(ИсточникПервичногоИнтереса);
			Элементы.ИсточникПервичногоИнтереса.ОтметкаНезаполненного = НЕ ЗначениеЗаполнено(ИсточникПервичногоИнтереса);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТипПВХ(ПВХСсылка)
	Возврат ТипЗнч(ПВХСсылка.ТипЗначения.ПривестиЗначение());
КонецФункции

&НаСервере
Процедура ПолучитьПредыдущийПервичныйИнтересПоПартнеру(ДатаАктуальности)
	
	ПервичныйИнтерес.Очистить();
	ВыводитьНадпись = Ложь;
	//пПартнер = Неопределено;
	//Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
	//	пПартнер = Партнер;
	//Иначе
	//	пПартнер = Объект.Партнер;
	//КонецЕсли;
	Если ЗначениеЗаполнено(сфпВладелец) Тогда
		Интерес = CRM_МаркетингСервер.ПолучитьПервичныйИнтерес(Объект.Дата,,сфпВладелец);
		Если ЗначениеЗаполнено(Интерес.КаналПервичногоИнтереса) Тогда
			
			СтрокаПервичногоИнтереса = ПервичныйИнтерес.Вставить(0);
			ЗаполнитьЗначенияСвойств(СтрокаПервичногоИнтереса,Интерес);
			СтрокаПервичногоИнтереса.Актуальность = Истина;
			
			Если ТипЗнч(Интерес.КаналПервичногоИнтереса.ТипЗначения.ПривестиЗначение()) = Тип("СправочникСсылка.МаркетинговыеМероприятия") 
			   И ЗначениеЗаполнено(Интерес.ИсточникПервичногоИнтереса) Тогда
				СтрокаПервичногоИнтереса.Актуальность = Интерес.ИсточникПервичногоИнтереса.CRM_ДатаАктуальности >= НачалоДня(Объект.Дата);
				ДатаАктуальности = Интерес.ИсточникПервичногоИнтереса.CRM_ДатаАктуальности;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГруппуИнтересаВФормеДокументаНаСервере(ИзмененКлиентКонтакт = Ложь)
	
	CRM_МетодыФормДокументовСервер.ЗаполнитьГруппуИнтересаВФормеДокумента(Объект, ЭтотОбъект, , ИзмененКлиентКонтакт, ТипЗнч(Объект.Ссылка), Объект.Ссылка.Пустая());
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВерсияДанныхОбъекта(ОбъектСсылка)
	сфпСофтФонПроСервер.сфпЗаписьЖурналаРегистрации("Отладка", "Запрос версии объекта: " + ОбъектСсылка.сфпИдентификаторЗвонка);
	Возврат ОбъектСсылка.ВерсияДанных;
КонецФункции

#Область ОбработчикиИнтереса

&НаКлиенте
Процедура АбонентКонтактПриИзменении(Элемент = Неопределено)

	Если ЗначениеЗаполнено(Объект.АбонентКонтакт) Тогда
		Объект.АбонентПредставление = Строка(Объект.АбонентКонтакт);
		
	Иначе
		Объект.АбонентПредставление = НСтр("ru='!!!Не определен!!!';en='!!!Undefined!!!'");
	КонецЕсли;
	
	сфпЗаполнитьВладельцаКонтакта();
	УстановитьВидимостьКонтакта();
	УстановитьЗаголовокФормы();

	ЗаполнитьГруппуИнтересаВФормеДокументаНаСервере(Истина);
	CRM_МетодыФормДокументовКлиент.УстановитьСвойстваГруппыИнтересВФормеДокумента(ЭтотОбъект);
	
	СформироватьОписаниеКаналаИсточника();
	ДоступностьПервичногоИнтереса();
	
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ПринятьОбращение(Команда)

	Если Модифицированность Тогда
		Записать();
	КонецЕсли;

	ПараметрыФормы = Новый Структура();

	МассивСсылок = Новый Массив();
	ПараметрыФормы.Вставить("ТелефонныйЗвонок", Объект.Ссылка);
	ПараметрыФормы.Вставить("МассивСсылок", МассивСсылок);
	ПараметрыФормы.Вставить("НомерТелефона", Объект.АбонентКакСвязаться);
	Если ЗначениеЗаполнено(Объект.АбонентКонтакт) Тогда
		МассивСсылок.Добавить(Объект.АбонентКонтакт);
	КонецЕсли;

	ОткрытьФорму("Обработка.CRM_МастерРегистрацииОбращения.Форма", ПараметрыФормы, ЭтотОбъект, Объект.АбонентКакСвязаться);

КонецПроцедуры

&НаКлиенте
Процедура ОтклонитьОбращение(Команда)
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		
		ТекущееСостояние = Неопределено;
		Если CRM_МетодыФормДокументовСервер.ОбращениеНельзяОтклонить(Объект.Ссылка, ТекущееСостояние) Тогда
			CRM_МетодыФормДокументовКлиент.ПоказатьПредупреждениеОбращениеОбработано(ТекущееСостояние);
			Возврат;
		КонецЕсли;
		
		Если УказыватьПричинуОтклонения(Объект.Ссылка) Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("ОтклонитьОбращениеЗавершение", ЭтотОбъект, Объект.Ссылка);
			ОткрытьФорму("Обработка.CRM_МастерРегистрацииОбращения.Форма.ФормаПотериОбращения", , ЭтотОбъект,, ВариантОткрытияОкна.ОтдельноеОкно,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

		Иначе	
			ОтклонитьОбращениеЗавершение(Истина, Объект.Ссылка);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтклонитьОбращениеЗавершение(Результат, Ссылка) Экспорт
	
	Если Результат = Неопределено ИЛИ Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	
	Иначе
	
		Если ТипЗнч(Результат) = Тип("Структура") И Результат.Свойство("ПричинаОтказа") И ТипЗнч(Результат.ПричинаОтказа) = Тип("СправочникСсылка.CRM_ПричиныОтклоненияОбращений") Тогда
			ОтклонитьОбращениеНаСервере(Ссылка, Результат.ПричинаОтказа, Результат.Комментарий);

		Иначе
			ОтклонитьОбращениеНаСервере(Ссылка, Неопределено, "");
		КонецЕсли;

		Объект.CRM_СкрытьВАРМ = Истина;
		Записать();

	КонецЕсли;

	Закрыть();

КонецПроцедуры

&НаСервере
Процедура ОтклонитьОбращениеНаСервере(Ссылка, ПричинаОтказа, Комментарий)
	
	Если РегистрыСведений.CRM_СостоянияЛидов.СсылкаЯвляетсяЛидом(Ссылка) Тогда
		РегистрыСведений.CRM_СостоянияЛидов.ЗаписатьСостояниеЛида(Ссылка, Справочники.CRM_СостоянияЛидов.Отклонен,, ПричинаОтказа, Комментарий); 
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция УказыватьПричинуОтклонения(Ссылка)
	Возврат РегистрыСведений.CRM_СостоянияЛидов.СсылкаЯвляетсяЛидом(Ссылка, Истина);
КонецФункции

&НаСервере
Процедура СформироватьОписаниеКаналаИсточника()
	
	//Надпись = "";
	//Интерес = Неопределено;
	//КаналПервичногоИнтереса = Неопределено;
	//ИсточникПервичногоИнтереса = Неопределено;
	//
	//Если ПолучитьФункциональнуюОпцию("ФиксироватьПервичныйИнтерес") Тогда
	//	Если ЗначениеЗаполнено(пПартнер) Тогда
	//		Интерес = CRM_МаркетингСервер.ПолучитьПервичныйИнтерес(Объект.Дата,, пПартнер);
	//		Если ЗначениеЗаполнено(Интерес) И ЗначениеЗаполнено(Интерес.КаналПервичногоИнтереса) Тогда
	//			Надпись = "Канал: " + Интерес.КаналПервичногоИнтереса;
	//			Если ТипЗнч(Интерес.КаналПервичногоИнтереса.ТипЗначения.ПривестиЗначение()) <> Тип("ПеречислениеСсылка.CRM_КаналыБезУказанияИсточника") Тогда
	//				Надпись = Надпись + Символы.ПС + "Источник: " + Интерес.ИсточникПервичногоИнтереса;
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;

	//Элементы.ДекорацияИсточникПривлечения.Заголовок = Надпись;
	//  Элементы.ГруппаИсточникПривлечения.Видимость = ЗначениеЗаполнено(Надпись);

	Если ПолучитьФункциональнуюОпцию("ФиксироватьПервичныйИнтерес") Тогда
		
		КаналПервичногоИнтереса = Неопределено;
		ИсточникПервичногоИнтереса = Неопределено;
		Элементы.РанееЗарегистрированныйИнтерес.Видимость = ЗначениеЗаполнено(сфпВладелец);
		ПервичныйИнтерес.Очистить();
		ВыводитьНадпись = Ложь;
		//пПартнер = Неопределено;
		//Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
		//	пПартнер = Партнер;
		//Иначе
		//	пПартнер = Объект.Партнер;
		//КонецЕсли;
		
		Если ЗначениеЗаполнено(сфпВладелец) Тогда
			
			АктуальноДо = '00010101';
			ПолучитьПредыдущийПервичныйИнтересПоПартнеру(АктуальноДо);
			
			Интерес = Неопределено;
			Попытка
				
				Интерес = ПервичныйИнтерес.Получить(0);
				
			Исключение	КонецПопытки;
			
			РанееНеЗарегистровано = Ложь;
			Если Интерес <> Неопределено И ЗначениеЗаполнено(Интерес.КаналПервичногоИнтереса) Тогда
				ВыводитьНадпись = Истина;
					Надпись = "";
					CRM_МаркетингСервер.СформироватьНадписьПервичногоИнтереса(Объект.Ссылка, Интерес, АктуальноДо, Надпись, ВыводитьНадпись);
					Элементы.РанееЗарегистрированныйИнтерес.Заголовок = Надпись;
			КонецЕсли;
			
			Элементы.РанееЗарегистрированныйИнтерес.Видимость = ВыводитьНадпись;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция МассивЭлементовСостоянияОбращения()
	
	МассивЭлементов = Новый Массив;
	
	МассивЭлементов.Добавить(Элементы.ГруппаСостояниеЛида);
	МассивЭлементов.Добавить(Элементы.ПричинаОтклонения);
	МассивЭлементов.Добавить(Элементы.КомментарийСостоянияЛида);
	МассивЭлементов.Добавить(Элементы.ДекорацияЗаголовокСостояниеЛида);
	МассивЭлементов.Добавить(Элементы.ДекорацияСостояниеЛида);	
	МассивЭлементов.Добавить(Элементы.СостояниеЛида);
	МассивЭлементов.Добавить(Элементы.ФормаОтклонитьОбращение);

	Возврат МассивЭлементов;
	
КонецФункции

&НаСервере
Процедура ОбновитьСостояниеОбращения()
	
	// Установка значений по умолчанию:
	СостояниеЛида = Неопределено;
	ПричинаОтклоненияЛида = Неопределено;
	КомментарийСостоянияЛида = Неопределено;
	ЛидСконвертированВОбъект = Неопределено;
	
	CRM_МетодыФормДокументовСервер.ВосстановитьНастройкиЭлементовСостоянияОбращения(АдресНастройкиЭлементовСостоянияОбращения,
																					МассивЭлементовСостоянияОбращения());

	Если РегистрыСведений.CRM_СостоянияЛидов.СсылкаЯвляетсяЛидом(Объект.Ссылка) Тогда
		СтруктураСостоянияЛида = РегистрыСведений.CRM_СостоянияЛидов.ПолучитьТекущееСостояниеЛида(Объект.Ссылка);
		Если СтруктураСостоянияЛида = Неопределено ИЛИ НЕ Объект.Входящий Тогда
			Элементы.ГруппаСостояниеЛида.Видимость = Ложь;
		Иначе
			СостояниеЛида = СтруктураСостоянияЛида.Состояние;
			Если СостояниеЛида <> Справочники.CRM_СостоянияЛидов.Новый Тогда
				Элементы.ФормаОтклонитьОбращение.Доступность = Ложь;
			КонецЕсли;

			Если СостояниеЛида = Справочники.CRM_СостоянияЛидов.Отклонен Тогда
				ПричинаОтклоненияЛида = СтруктураСостоянияЛида.ПричинаОтклонения;
				КомментарийСостоянияЛида = СтруктураСостоянияЛида.Комментарий;

				Элементы.ПричинаОтклонения.Видимость = ЗначениеЗаполнено(ПричинаОтклоненияЛида);
				Элементы.КомментарийСостоянияЛида.Видимость = ЗначениеЗаполнено(КомментарийСостоянияЛида);
				
				CRM_МетодыФормДокументовСервер.ДобавитьКомандуОтменитьОтклонение(ЭтаФорма, Элементы.ГруппаКомандаОтменитьОтклонение);
				
			Иначе
				ЛидСконвертированВОбъект = СтруктураСостоянияЛида.СконвертированВОбъект;
				Элементы.ПричинаОтклонения.Видимость = Ложь;
				Элементы.КомментарийСостоянияЛида.Видимость = Ложь;
			КонецЕсли;
			
			ОбновитьДатуОбработкиОбращения(СтруктураСостоянияЛида.ДатаОбработки);
			
		КонецЕсли;
		
		Элементы.ДекорацияЗаголовокСостояниеЛида.Видимость = Элементы.ПричинаОтклонения.Видимость ИЛИ Элементы.КомментарийСостоянияЛида.Видимость;

	Иначе
		Элементы.ГруппаСостояниеЛида.Видимость = Ложь;
		Элементы.ФормаОтклонитьОбращение.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.ДекорацияСостояниеЛида.Видимость = Элементы.ГруппаСостояниеЛида.Видимость;
	Элементы.СостояниеЛида.Видимость = Элементы.ГруппаСостояниеЛида.Видимость;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДатуОбработкиОбращения(ДатаОбработки)
	
	ШаблонЗаголовка = НСтр("ru = 'Дата обработки: %1'; en = 'Processing Date: %1'");
	Элементы.ДатаОбработкиОбращения.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонЗаголовка, Формат(ДатаОбработки,"ДФ='dd.MM.yyyy HH:mm'"));
	Элементы.ДатаОбработкиОбращения.Видимость = ЗначениеЗаполнено(ДатаОбработки);
	
КонецПроцедуры

&НаСервере
Функция ТелефонКонтактаСуществует(Контакт, Телефон)
	
	Если НЕ ЗначениеЗаполнено(Контакт) Тогда
		Возврат Неопределено;
	ИначеЕсли ПустаяСтрока(Контакт) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	КИСуществует = Ложь;
	
	Для Каждого СтрокаКИ Из Контакт.КонтактнаяИнформация Цикл
		
		Если НЕ (СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон) Тогда
			Продолжить;
		Иначе
			СтруктураНомера	= сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(СтрокаКИ.Представление);
			ТелефонКИ = СтрЗаменить(сфпСофтФонПроСервер.сфпПреобразоватьНомерСУчетомПрефиксов(СтруктураНомера), "+", "");
			Если Прав(ТелефонКИ, 7) = Прав(Телефон, 7) Тогда	
				КИСуществует = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат КИСуществует;
	
КонецФункции

&НаСервереБезКонтекста
Функция УбратьРазделителиВНомерТелефона(Знач НомерТелефона)
	Поз = Найти(НомерТелефона, ",");
	Если Поз <> 0 Тогда
		НомерТелефона = Лев(НомерТелефона, Поз-1);
	КонецЕсли;
	
	НомерТелефона = СтрЗаменить(НомерТелефона, "-", "");
	НомерТелефона = СтрЗаменить(НомерТелефона, " ", "");
	НомерТелефона = СтрЗаменить(НомерТелефона, "+", "");

	Возврат НомерТелефона;
КонецФункции

&НаСервере
Функция ДобавитьТелефонКонтакту(Контакт, Телефон)
	
	КИСуществует = ТелефонКонтактаСуществует(Контакт, Телефон);
	
	Если КИСуществует = Неопределено Тогда
		Возврат Ложь;
	ИначеЕсли КИСуществует Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ТипЗнч(Контакт) = Тип("СправочникСсылка.Партнеры") Тогда
		ВидКИ	= Справочники.ВидыКонтактнойИнформации.ТелефонПартнера;
	ИначеЕсли ТипЗнч(Контакт) = Тип("СправочникСсылка.CRM_ПотенциальныеКлиенты") Тогда
		ВидКИ	= Справочники.ВидыКонтактнойИнформации.CRM_ТелефонПотенциальногоКлиента;
	ИначеЕсли ТипЗнч(Контакт) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
		ВидКИ	= Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица;
	ИначеЕсли ТипЗнч(Контакт) = Тип("СправочникСсылка.Пользователи") Тогда
		ВидКИ	= Справочники.ВидыКонтактнойИнформации.ТелефонПользователя;
	ИначеЕсли ТипЗнч(Контакт) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		ВидКИ	= Справочники.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	КонтактОбъект = Контакт.ПолучитьОбъект();
	НоваяСтрока = КонтактОбъект.КонтактнаяИнформация.Добавить();
	НоваяСтрока.Вид	= ВидКИ;
	НоваяСтрока.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	
	СтруктураТелефона = сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(Телефон);
	НоваяСтрока.Представление = УправлениеКонтактнойИнформациейКлиентСервер.СформироватьПредставлениеТелефона(СтруктураТелефона.КодСтраны, СтруктураТелефона.КодГорода, СтруктураТелефона.НомерТелефона, "","");
	НоваяСтрока.Значение = УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(НоваяСтрока.Представление, НоваяСтрока.Вид);
	НоваяСтрока.НомерТелефонаБезКодов = УбратьРазделителиВНомерТелефона(СтруктураТелефона.НомерТелефона);
	НоваяСтрока.НомерТелефона         = УбратьРазделителиВНомерТелефона(СтруктураТелефона.КодСтраны + СтруктураТелефона.КодГорода + СтруктураТелефона.НомерТелефона);
	НоваяСтрока.ЗначенияПолей = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(НоваяСтрока.Значение, НоваяСтрока.Представление, НоваяСтрока.Вид);
		
	АдресЗаписан = Истина;
	
	Попытка
		КонтактОбъект.Записать();
	Исключение
		АдресЗаписан = Ложь;
	КонецПопытки;
	
	Возврат АдресЗаписан;
	
КонецФункции

&НаКлиенте
Процедура ЗадатьВопросОСохраненииКИ()
	
	КИСуществует = ТелефонКонтактаСуществует(Объект.АбонентКонтакт, Объект.АбонентКакСвязаться);
	Если КИСуществует = Неопределено ИЛИ КИСуществует = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ШаблонВопроса = НСтр("ru = 'Сохранить в карточке контакта телефон: %1?'");
	ТекстВопроса = СтрШаблон(ШаблонВопроса, Объект.АбонентКакСвязаться);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗадатьВопросОСохраненииКИЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопросОСохраненииКИЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Если НЕ ДобавитьТелефонКонтакту(Объект.АбонентКонтакт, Объект.АбонентКакСвязаться) Тогда
			Сообщение = НСтр("ru='Для автоматического связывания звонков с данным контактом укажите текущий телефон в его карточке'");
		КонецЕсли;
		
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти

// -CRM

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ.

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" элемента формы "Ответственный".
//
Процедура ОтветственныйПриИзменении(Элемент)
	
	Если Объект.Ответственный = Неопределено Тогда
		Объект.Ответственный = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	КонецЕсли;
	
	ВыбранПользователь = (ТипЗнч(Объект.Ответственный) = Тип("СправочникСсылка.Пользователи"));
	
	Если ВыбранПользователь Тогда
		
		Если Не ЗначениеЗаполнено(Объект.Ответственный) Тогда
			Объект.Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ОтветственныйПриИзменении()

&НаКлиенте
Процедура CRM_РольОтветственногоПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.CRM_РольОтветственного) Тогда
		
		Объект.Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
		
		Элементы.Ответственный.Видимость = Истина;
		Элементы.CRM_РольОтветственного.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ КОМАНД ФОРМЫ.

&НаКлиенте
// Процедура - обработчик команды формы "ПрослушатьЗаписьРазговора".
//
Процедура ПрослушатьЗаписьРазговора(Команда)
	
	ПараметрыЗвонка = Новый Структура("ИдентификаторЗвонка, ИдентификаторЗаписи, Ответственный, Входящий, НомерТелефона, ВнутреннийНомер, ДатаНачала, ДатаОкончания, Звонок",
		Объект.сфпИдентификаторЗвонка, Объект.сфпИдентификаторЗаписи, Объект.Ответственный, Объект.Входящий, Объект.АбонентКакСвязаться, сфпВнутреннийНомер, сфпДатаНачала, сфпДатаОкончания, Объект.Ссылка);
	сфпСофтФонПроКлиент.НачатьПрослушиваниеЗаписиРазговора(ПараметрыЗвонка, ЭтаФорма, Элементы.ФормаПрослушатьЗаписьРазговора);

КонецПроцедуры // ПрослушатьЗаписьРазговора()

&НаКлиенте
// Процедура, вызываемая после ответа пользователя по выбору создания типа контакта
// 
// Параметры:
//   Результат 					- ЭлементСпискаЗначений - Тип выбранного контакта для создания
//   ДополнительныеПараметры 	- Структура - Структура с передаваемыми доп. параметрами
//
Процедура СоздатьКонтактПослеВыбораТипаКонтакта(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	Если Результат.Значение = "КонтактныеЛицаПартнеров" Тогда
		ПараметрыФормы = Новый Структура("Основание", Новый Структура("НомерТелефона", Объект.АбонентКакСвязаться));
		ИмяФормыВыбора = ".Форма.CRM_ФормаБыстрогоВвода";
				
	ИначеЕсли Результат.Значение = "Партнеры" Тогда
		СтруктураПараметрыНового = Новый Структура;
		//СтруктураПараметрыНового.Вставить("Телефон", Объект.АбонентКакСвязаться);
		СтруктураПараметрыНового.Вставить("Наименование" , ?(СтрНайти(Объект.АбонентПредставление, "!!!") = 0, Объект.АбонентПредставление, ""));
		ПараметрыФормы = Новый Структура("Основание, ПараметрыНового", Объект.Ссылка, СтруктураПараметрыНового);
		ИмяФормыВыбора = ".ФормаОбъекта";
	Иначе
		ПараметрыФормы = Новый Структура("Основание", Объект.Ссылка);
		ИмяФормыВыбора = ".ФормаОбъекта";
	КонецЕсли;
	ОткрытьФорму("Справочник." + Результат.Значение + ИмяФормыВыбора, ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды формы "ДобавитьТелефон".
//
Процедура ДобавитьТелефон(Команда)
	ДобавитьТелефонНаСервер(Объект.АбонентКонтакт, Объект.АбонентКакСвязаться);
	//Элементы.ДобавитьТелефон.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды формы "СоздатьКонтактВыполнить".
//
Процедура СоздатьКонтактВыполнить()
	
	НовоеОповещение = Новый ОписаниеОповещения("СоздатьКонтактПослеВыбораТипаКонтакта", ЭтотОбъект);
	ПоказатьВыборИзМеню(НовоеОповещение, СписокИнтерактивноСоздаваемыхКонтактов, Элементы.СоздатьКонтакт);
	
КонецПроцедуры // СоздатьКонтактВыполнить()

&НаКлиенте
// Процедура - обработчик команды формы "СвязанныеВзаимодействияВыполнить".
//
Процедура СвязанныеВзаимодействияВыполнить()
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Предмет", Объект.Предмет);
	ОткрытьФорму("ЖурналДокументов.Взаимодействия.ФормаСписка", ПараметрыОтбора, ЭтотОбъект, , Окно);
КонецПроцедуры // СвязанныеВзаимодействияВыполнить()

&НаКлиенте
Процедура Перенаправить(Команда)
	
	Если Объект.Ссылка.Пустая() ИЛИ Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	МассивЗадач = Новый Массив;
	МассивЗадач.Добавить(Объект.Ссылка);
	CRM_БизнесПроцессыИЗадачиКлиент.ОбработкаКомандыПеренаправить(МассивЗадач, Новый Структура("Источник",ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренаправитьНаРоль(Команда)
	
	Если Объект.Ссылка.Пустая() ИЛИ Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	МассивЗадач = Новый Массив;
	МассивЗадач.Добавить(Объект.Ссылка);
	CRM_БизнесПроцессыИЗадачиКлиент.ОбработкаКомандыПеренаправить(МассивЗадач, Новый Структура("Источник",ЭтотОбъект), Тип("СправочникСсылка.РолиИсполнителей"));

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОтменитьОтклонение(Команда)
	CRM_МетодыФормДокументовКлиент.ОтменитьОтклонение(Объект.Ссылка, Элементы.ГруппаКомандаОтменитьОтклонение);
	ОбновитьСостояниеОбращения();
	Прочитать();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	CRM_СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтотОбъект, Команда);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ.

&НаСервере
// Процедура - обработчик события формы "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Автор = сфпСофтФонПроСервер.сфпТекущийПользователь();
		Объект.Ответственный = сфпСофтФонПроСервер.сфпТекущийПользователь();
		Объект.Дата = CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса();
		Объект.Важность = Перечисления.ВариантыВажностиВзаимодействия.Обычная;
		Взаимодействия.УстановитьПредметПоДаннымЗаполнения(Параметры, Предмет);
	КонецЕсли;
	
	// Лиды
	НаборСвойствНастроекЭлементовСостоянияОбращения = Новый Массив;
	НаборСвойствНастроекЭлементовСостоянияОбращения.Добавить("Видимость");
	НаборСвойствНастроекЭлементовСостоянияОбращения.Добавить("Доступность");
	АдресНастройкиЭлементовСостоянияОбращения = CRM_МетодыФормДокументовСервер.СохранитьНастройкиЭлементовСостоянияОбращения(ЭтаФорма,
																															МассивЭлементовСостоянияОбращения(),
																															НаборСвойствНастроекЭлементовСостоянияОбращения);
	ОбновитьСостояниеОбращения();
	
	
	Если Параметры.Свойство("СпозиционироватьсяНаРеквизите") И ЗначениеЗаполнено(Параметры.СпозиционироватьсяНаРеквизите) Тогда
		СпозиционироватьсяНаРеквизите = Параметры.СпозиционироватьсяНаРеквизите;
	КонецЕсли;	
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Входящий = НЕ (Параметры.Свойство("Основание") И НЕ (Параметры.Основание = Ложь ИЛИ Параметры.Основание = Неопределено));
	КонецЕсли;
	
	Если Параметры.Свойство("АбонентКонтакт") И ЗначениеЗаполнено(Параметры.АбонентКонтакт) Тогда
		Объект.АбонентКонтакт = Параметры.АбонентКонтакт;
		Объект.АбонентПредставление = Строка(Объект.АбонентКонтакт);
		
		Модифицированность = Истина;				
	КонецЕсли;
	
	// Подготовить оповещения взаимодействий.
	Взаимодействия.ПодготовитьОповещения(ЭтотОбъект,Параметры);
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ВерсионированиеОбъектов") Тогда
		МодульВерсионированиеОбъектов = ОбщегоНазначения.ОбщийМодуль("ВерсионированиеОбъектов");
		МодульВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
		МодульПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "СтраницаДополнительныеРеквизиты");
		ДополнительныеПараметры.Вставить("ОтложеннаяИнициализация", Ложь);
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	Если Параметры.Свойство("ДанныеУчастника") И Объект.АбонентКонтакт <> Параметры.ДанныеУчастника.Контакт Тогда
		ЗаполнитьНаОснованииУчастника(Параметры.ДанныеУчастника);
	КонецЕсли;
	
	сфпЗаполнитьВладельцаКонтакта();
	
	ПриСозданииИПриЧтенииНаСервере();
	//ВзаимодействияКлиентСервер.ПроверитьЗаполнениеКонтактов(Объект, ЭтотОбъект, "ТелефонныйЗвонок");
	
	// +CRM
	CRM_МетодыФормДокументовСервер.СоздатьНеобходимыеРеквизитыИЭлементыДляГруппыИнтерес(ЭтотОбъект, "ГруппаИнтерес");
	
	CRM_СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	СформироватьОписаниеКаналаИсточника();
	
	НеобходимыеДействияПриСозданииНаСервереЧтенииНаСервере();
	
	ЗаполнятьПервичныйИнтерес = Константы.CRM_ЗаполнятьПервичныйИнтерес.Получить();
	Если НЕ Объект.Ссылка.Пустая() Тогда
		Элементы.РанееЗарегистрированныйИнтерес.Видимость = Ложь;
	КонецЕсли;
	// -CRM
	
	//Если Элементы.Найти("СкрытьПоказатьИнтересы") <> Неопределено Тогда
		//Элементы.СкрытьПоказатьИнтересы.Видимость = Ложь;
	//КонецЕсли;
	
	сфпИспользоватьРечевуюАналитику = Константы.сфпИспользоватьРечевуюАналитику.Получить();
	Элементы.ГруппаРечеваяАналитика.Видимость = сфпИспользоватьРечевуюАналитику;
		
	Если НЕ Объект.Ссылка.Пустая() Тогда
		Запрос = Новый Запрос("
		|ВЫБРАТЬ ВнутреннийНомер, ДатаНачала, ДатаОтвета, ДатаОкончания
		|ИЗ РегистрСведений.сфпИсторияЗвонков
		|ГДЕ Звонок = &Звонок И ИдентификаторЗвонка = &ИдентификаторЗвонка");
		Запрос.УстановитьПараметр("Звонок", Объект.Ссылка);
		Запрос.УстановитьПараметр("ИдентификаторЗвонка", Объект.сфпИдентификаторЗвонка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			сфпВнутреннийНомер = Выборка.ВнутреннийНомер;
			сфпДатаНачала = Выборка.ДатаНачала;
			сфпДатаОтвета = Выборка.ДатаОтвета;
			сфпДатаОкончания = Выборка.ДатаОкончания;
		КонецЕсли;
		
		Если сфпИспользоватьРечевуюАналитику Тогда
			Запрос = Новый Запрос("
			|ВЫБРАТЬ Тематика, Количество, СтопСлова
			|ИЗ РегистрСведений.сфпРечеваяАналитика
			|ГДЕ Звонок = &Звонок
			|УПОРЯДОЧИТЬ ПО Тематика
			|АВТОУПОРЯДОЧИВАНИЕ");
			Запрос.УстановитьПараметр("Звонок", Объект.Ссылка);
			сфпТематикиРазговора.Загрузить(Запрос.Выполнить().Выгрузить());
		КонецЕсли;
	КонецЕсли;
	
	СписокВидовКонтактовДляВыбора = Новый СписокЗначений();
	СписокВидовКонтактовДляВыбора.Добавить("Партнеры", Нстр("ru='Клиенты';en='Customers'"));
	СписокВидовКонтактовДляВыбора.Добавить("КонтактныеЛицаПартнеров", Нстр("ru='Контактные лица';en='Contact persons'"));
	СписокВидовКонтактовДляВыбора.Добавить("CRM_ПотенциальныеКлиенты", Нстр("ru='Потенциальные клиенты';en='Potential сustomers'"));
	
	СписокИнтерактивноСоздаваемыхКонтактов = Новый СписокЗначений();
	СписокИнтерактивноСоздаваемыхКонтактов.Добавить("Партнеры", Нстр("ru='Создать клиента';en='Create customer'"));
	СписокИнтерактивноСоздаваемыхКонтактов.Добавить("КонтактныеЛицаПартнеров", Нстр("ru='Создать контактное лицо';en='Create contact person'"));
	СписокИнтерактивноСоздаваемыхКонтактов.Добавить("CRM_ПотенциальныеКлиенты", Нстр("ru='Создать потенциального клиента';en='Create potential customer'"));
	
	Если Параметры.Свойство("CRM_ОтключитьКомандыПереадресации") Тогда
		Элементы.ОбщаяКомандаCRM_УстановитьНовогоОтветственного.Доступность = Ложь;
		Элементы.ПеренаправитьНаРоль.Доступность = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.CRM_РольОтветственного) И Не ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Элементы.Ответственный.Видимость = Ложь;
		Элементы.CRM_РольОтветственного.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
// Процедура - обработчик события формы "ПриОткрытии".
//
Процедура ПриОткрытии(Отказ)
	
	сфпДлительность = Дата('00010101') + Объект.сфпДлительностьЗвонка;
	
	УстановитьЗаголовокФормы();
	
	Если Объект.Входящий Тогда
		Если Объект.сфпСостояниеЗвонка = ПредопределенноеЗначение("Перечисление.сфпСостоянияЗвонков.Пропущенный") Тогда
			Элементы.СостояниеЗвонка.Заголовок = НСтр("ru='Пропущенный';en='Missed'"); 
			Элементы.СостояниеЗвонка.ЦветТекста = WebЦвета.Красный;

		Иначе	
			Элементы.СостояниеЗвонка.Заголовок = НСтр("ru='Отвеченный';en='Answered'");
			Элементы.СостояниеЗвонка.ЦветТекста = WebЦвета.Зеленый;
		КонецЕсли;

		Элементы.ГруппаЛево.Заголовок = НСтр("ru='Кто звонил';en='Caller'");
		Элементы.ГруппаПраво.Заголовок = НСтр("ru='Кто ответил';en='Who answered'");
		
	Иначе
		Если Объект.сфпСостояниеЗвонка = ПредопределенноеЗначение("Перечисление.сфпСостоянияЗвонков.Пропущенный") Тогда
			Элементы.СостояниеЗвонка.Заголовок = НСтр("ru='Не дозвонились';en='Not reached'");
			Элементы.СостояниеЗвонка.ЦветТекста = WebЦвета.Красный;

		Иначе	
			Элементы.СостояниеЗвонка.Заголовок = НСтр("ru='Отвеченный';en='Answered'");;
			Элементы.СостояниеЗвонка.ЦветТекста = WebЦвета.Зеленый;
		КонецЕсли;	
		
		Элементы.ГруппаЛево.Заголовок = НСтр("ru='Кому звонили';en='Called Whom'");
		Элементы.ГруппаПраво.Заголовок = НСтр("ru='Кто звонил';en='Caller'");
	КонецЕсли;
			
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// +CRM
	ДоступностьПервичногоИнтереса();
	
	CRM_МетодыФормДокументовКлиент.УстановитьСвойстваГруппыИнтересВФормеДокумента(ЭтотОбъект);
	// -CRM
	
	Попытка
		Если ЗначениеЗаполнено(СпозиционироватьсяНаРеквизите) Тогда
			ТекущийЭлемент = Элементы[СпозиционироватьсяНаРеквизите];
		КонецЕсли;
	Исключение КонецПопытки;
	
	сфпРазрешеныИзмененияВДокументе();

	УстановитьВидимостьКонтакта();

КонецПроцедуры // ПриОткрытии()

&НаКлиенте
Процедура УстановитьВидимостьКонтакта()
	
	Если ЗначениеЗаполнено(Объект.АбонентКонтакт) Тогда
		Элементы.ГруппаАбонентПредставление.Видимость = Ложь;
		Элементы.АбонентКонтакт.Видимость = Истина;
		
	Иначе
		Элементы.ГруппаАбонентПредставление.Видимость = Истина;
		Элементы.АбонентКонтакт.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.СоздатьКонтакт.Видимость = Элементы.ГруппаАбонентПредставление.Видимость;
	Элементы.сфпВладелец.Видимость = ЗначениеЗаполнено(Объект.АбонентКонтакт) И ТипЗнч(Объект.АбонентКонтакт) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров");

КонецПроцедуры	
	
&НаКлиенте
// Процедура - обработчик события формы "ОбработкаОповещения".
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если (ИмяСобытия = "СофтФон_КонецРазговора") И Параметр.Свойство("Звонок") Тогда
		Если (Параметр.Звонок = Объект.Ссылка) Тогда
			Объект.сфпДлительностьЗвонка = сфпСофтФонПроСервер.сфпТекущаяДата() - Объект.Дата;
			Объект.сфпСостояниеЗвонка = ПредопределенноеЗначение("Перечисление.сфпСостоянияЗвонков.Отвеченный");
			сфпДлительность	= Дата('00010101') + Объект.сфпДлительностьЗвонка;
			Объект.Описание	= сфпСофтФонПроСервер.сфпЗаполнитьОписаниеТелефонногоЗвонка(Объект.сфпДлительностьЗвонка);
			Если Параметр.Свойство("НовыйОтветственный") Тогда
				Объект.Ответственный = Параметр.НовыйОтветственный;
			КонецЕсли;
			
			Элементы.ОбщаяКомандаCRM_УстановитьНовогоОтветственного.Доступность = Истина;
			Элементы.ПеренаправитьНаРоль.Доступность = Истина;
			
			Модифицированность = Истина;
			
			Попытка
				ЭтаФорма.Записать();
			Исключение КонецПопытки;
		КонецЕсли;
		
		Возврат;
		
	ИначеЕсли (ИмяСобытия = "сфпКонецРазговора") И Параметр.Свойство("Звонок") Тогда
		Если (Параметр.Звонок = Объект.Ссылка) Тогда
			
			Если Объект.ВерсияДанных <> ВерсияДанныхОбъекта(Объект.Ссылка) Тогда
				ЭтаФорма.Прочитать();
			КонецЕсли;
			
			Если Параметр.Свойство("СостояниеЗвонка") И (Объект.сфпСостояниеЗвонка <> Параметр.СостояниеЗвонка) Тогда
				Объект.сфпСостояниеЗвонка = Параметр.СостояниеЗвонка;
				Модифицированность = Истина;
			КонецЕсли;
			
			Если Параметр.Свойство("ДлительностьЗвонка") И (Объект.сфпДлительностьЗвонка <> Параметр.ДлительностьЗвонка) Тогда
				Объект.сфпДлительностьЗвонка = Параметр.ДлительностьЗвонка;
				Модифицированность = Истина;
			КонецЕсли;	
			
			Если Параметр.Свойство("ИдентификаторЗаписи") И НЕ ЗначениеЗаполнено(Объект.сфпИдентификаторЗаписи) Тогда
				Объект.сфпИдентификаторЗаписи = Параметр.ИдентификаторЗаписи;
				Модифицированность = Истина;
			КонецЕсли;
			
			сфпДлительность	= Дата('00010101') + Объект.сфпДлительностьЗвонка;
			Объект.Описание	= сфпСофтФонПроСервер.сфпЗаполнитьОписаниеТелефонногоЗвонка(Объект.сфпДлительностьЗвонка);
			Если ЗначениеЗаполнено(Элементы.Комментарий.ТекстРедактирования) Тогда
				Объект.Комментарий = Элементы.Комментарий.ТекстРедактирования;
			КонецЕсли;
			
			Элементы.ОбщаяКомандаCRM_УстановитьНовогоОтветственного.Доступность = Истина;
			Элементы.ПеренаправитьНаРоль.Доступность = Истина;
			
			Попытка
				ЭтаФорма.Записать();
			Исключение КонецПопытки;
		КонецЕсли;

	 	Возврат;

	ИначеЕсли (ИмяСобытия = "Софтфон_CoMagic") И Параметр.Свойство("Звонок") Тогда
		Если Параметр.Звонок = Объект.Ссылка Тогда
			Если (Объект.сфпДлительностьЗвонка = 0) И (сфпСтруктураВнешнихДанных = Неопределено) Тогда
				// Заполняем документ данными из CoMagic
				сфпСтруктураВнешнихДанных	= Параметр.СтруктураCoMagic;
				Объект.сфпCoMagicID			= сфпСтруктураВнешнихДанных.comagic_context.visitor_id;
				Объект.Комментарий = Объект.Комментарий + ?(ПустаяСтрока(Объект.Комментарий), "", Символы.ПС) 
					+ НСтр("ru='Кампания: ';en='Campaign: '") + сфпСтруктураВнешнихДанных.comagic_context.campaign + Символы.ПС 
					+ НСтр("ru='Сайт: ';en='Website: '") + сфпСтруктураВнешнихДанных.comagic_context.site + Символы.ПС
					+ НСтр("ru='Ключевые слова: ';en='Keywords: '") + сфпСтруктураВнешнихДанных.comagic_context.search_query;
					
				ИмяПредопределенногоЗначения = "ПланВидовХарактеристик.КаналыРекламныхВоздействий.CRM_CoMagic";	
				КаналПервичногоИнтереса = ПредопределенноеЗначение(ИмяПредопределенногоЗначения);
				ИсточникПервичногоИнтереса = сфпСофтФонПроСервер.сфпНайтиМаркетинговоеМероприятие(сфпСтруктураВнешнихДанных.comagic_context.campaign);
			
				Если НЕ ЗначениеЗаполнено(Объект.АбонентКонтакт) Тогда
					сфпЗаполнитьПартнераИКонтактноеЛицоИзCoMagic();
				КонецЕсли;			
				
				Модифицированность	= Истина;
				
				Попытка
					ЭтаФорма.Записать();
				Исключение КонецПопытки;
			КонецЕсли;	
		КонецЕсли;	
		
		Возврат;

	ИначеЕсли (ИмяСобытия = "ЗаполнитьКонтактВТелефонномЗвонке") И Параметр.Свойство("Звонок") Тогда
		Если Параметр.Звонок = Объект.Ссылка Тогда
			Объект.АбонентКонтакт = Параметр.Контакт;
			Объект.АбонентПредставление = Строка(Объект.АбонентКонтакт);
			Элементы.СоздатьКонтакт.Видимость = Ложь;
			
			Модифицированность = Истина;
			
			Попытка
				ЭтаФорма.Записать();
			Исключение КонецПопытки;
			
			сфпЗаполнитьВладельцаКонтакта();
			УстановитьВидимостьКонтакта();
		КонецЕсли;			
		
		Возврат;
		
	ИначеЕсли ИмяСобытия = "Создано новое контактное лицо" Тогда
		
		ПриВыбореКонтакта(Параметр);
		
	ИначеЕсли ИмяСобытия = "ПринятиеОбращения" И Источник = Объект.Ссылка Тогда
		
		Прочитать();
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	ВзаимодействияКлиент.ОтработатьОповещение(ЭтотОбъект,ИмяСобытия, Параметр, Источник);
	
	CRM_СобытияФормКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);

КонецПроцедуры // ОбработкаОповещения()

&НаСервере
// Процедура - обработчик события формы "ПриЧтенииНаСервере".
//
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	ПриСозданииИПриЧтенииНаСервере();
	
	// CRM_УправлениеДоступом
	МодульУправлениеДоступом = CRM_ОбщегоНазначенияСервер.ОбщийМодуль("CRM_УправлениеДоступомУровниДоступа");
	Если МодульУправлениеДоступом <> Неопределено Тогда
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец CRM_УправлениеДоступом
	
КонецПроцедуры // ПриЧтенииНаСервере()

&НаСервере
// Процедура - обработчик события формы "ПередЗаписьюНаСервере".
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	Взаимодействия.ПередЗаписьюВзаимодействияИзФормы(ЭтотОбъект, ТекущийОбъект, ИзменилисьКонтакты);
	
	CRM_СобытияФорм.ПередЗаписьюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи);

КонецПроцедуры // ПередЗаписьюНаСервере()

&НаСервере
// Процедура - обработчик события формы "ПриЗаписиНаСервере".
//
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Взаимодействия.ПриЗаписиВзаимодействияИзФормы(ТекущийОбъект, ЭтотОбъект);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ПолучитьФункциональнуюОпцию("ФиксироватьПервичныйИнтерес") Тогда
		// Зафиксировать актуальный источник привлечения.
		НаборРегистра = РегистрыСведений.ИсточникиПервичногоИнтереса.СоздатьНаборЗаписей();
		НаборРегистра.Отбор.Сделка.Установить(ТекущийОбъект.Ссылка);
		НаборРегистра.Прочитать();
		НаборРегистра.Очистить();
		
		//Если ЗначениеЗаполнено(сфпВладелец) И (ЗначениеЗаполнено(КаналПервичногоИнтереса) ИЛИ
		//ЗначениеЗаполнено(ИсточникПервичногоИнтереса)) Тогда
		Если ЗначениеЗаполнено(КаналПервичногоИнтереса) ИЛИ ЗначениеЗаполнено(ИсточникПервичногоИнтереса) Тогда
			Запись								= НаборРегистра.Добавить();
			Запись.Период						= ?(ЗначениеЗаполнено(ТекущийОбъект.Дата), ТекущийОбъект.Дата, CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса());
			Запись.Партнер						= сфпВладелец;
			Запись.Сделка						= ТекущийОбъект.Ссылка;
			Запись.ИсточникПервичногоИнтереса	= ИсточникПервичногоИнтереса;
			Запись.КаналПервичногоИнтереса		= КаналПервичногоИнтереса;
		КонецЕсли;
		
		НаборРегистра.Записать();
	КонецЕсли;

КонецПроцедуры // ПриЗаписиНаСервере()

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	ОбновитьСостояниеОбращения();
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события формы "ПослеЗаписи".
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ВзаимодействияКлиент.ВзаимодействиеПредметПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи, "ТелефонныйЗвонок");
	
	Если НЕ ПустаяСтрока(Объект.сфпCoMagicID) Тогда
		Если ЗначениеЗаполнено(Объект.АбонентКонтакт) Тогда
			Если сфпСофтФонПроСервер.сфпРеквизитСуществует(Объект.АбонентКонтакт, "сфпCoMagicID") Тогда
				сфпСофтФонПроСервер.сфпЗаписатьIDCoMagic(Объект.АбонентКонтакт, Объект.сфпCoMagicID);
				Объект.сфпCoMagicID = "";
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;

	Оповестить("ОбновленыДанныеТелефонногоЗвонка", Объект.Ссылка);

КонецПроцедуры // ПослеЗаписи()

&НаСервере
// Процедура - обработчик события формы "ОбработкаПроверкиЗаполненияНаСервере".
//
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры // ОбработкаПроверкиЗаполненияНаСервере()

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	CRM_ТрудозатратыКлиент.ПередЗакрытием(ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	CRM_ТрудозатратыКлиент.ПриЗакрытии(ЭтотОбъект, ЗавершениеРаботы);
КонецПроцедуры

&НаКлиенте
Процедура ПриВыбореКонтакта(ВыбранныйКонтакт)
	
	ИмяМетаданных = сфпСофтФонПроСервер.сфпПолучитьИмяМетаданных(ВыбранныйКонтакт);
	Если СписокВидовКонтактовДляВыбора.НайтиПоЗначению(ИмяМетаданных) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.АбонентКонтакт = ВыбранныйКонтакт;
	АбонентКонтактПриИзменении();
	
КонецПроцедуры
	
&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	Если Источник.ВладелецФормы <> ЭтаФорма Тогда
		Возврат;
	КонецЕсли;
	
	ПриВыбореКонтакта(НовыйОбъект);

КонецПроцедуры

&НаКлиенте
// Процедура, вызываемая после ответа пользователя по выбору создания типа контакта
// 
// Параметры:
//   Результат 					- ЭлементСпискаЗначений - Тип выбранного контакта для создания
//   ДополнительныеПараметры 	- Структура - Структура с передаваемыми доп. параметрами
//
Процедура ВыбратьКонтактПослеВыбораТипаКонтакта(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник." + Результат.Значение + ".ФормаВыбора",, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура АбонентПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НовоеОповещение = Новый ОписаниеОповещения("ВыбратьКонтактПослеВыбораТипаКонтакта", ЭтаФорма);
	ПоказатьВыборИзМеню(НовоеОповещение, СписокВидовКонтактовДляВыбора, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ВладелецФормы <> ЭтаФорма Тогда
		Возврат;
	КонецЕсли;
	
	ПриВыбореКонтакта(ВыбранноеЗначение);
	
	ЗадатьВопросОСохраненииКИ();
	
КонецПроцедуры

&НаКлиенте
Процедура АбонентКонтактНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НовоеОповещение = Новый ОписаниеОповещения("ВыбратьКонтактПослеВыбораТипаКонтакта", ЭтаФорма);
	ПоказатьВыборИзМеню(НовоеОповещение, СписокВидовКонтактовДляВыбора, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокФормы()
	
	Заголовок = НСтр("ru='Звонок';en='Call'");
	
	Если Объект.Входящий Тогда
		Заголовок = Заголовок + НСтр("ru=' входящий ';en=' Incoming '");
		Если Объект.сфпСостояниеЗвонка = ПредопределенноеЗначение("Перечисление.сфпСостоянияЗвонков.Пропущенный") Тогда
			  Заголовок = Заголовок + НСтр("ru='(пропущенный)';en='(Missed)'");
		Иначе Заголовок = Заголовок + НСтр("ru='(отвеченный)';en='(Answered)'");
		КонецЕсли;

	Иначе
		Заголовок = Заголовок + НСтр("ru=' исходящий ';en=' Outcoming '");
		Если Объект.сфпСостояниеЗвонка = ПредопределенноеЗначение("Перечисление.сфпСостоянияЗвонков.Пропущенный") Тогда
			  Заголовок = Заголовок + НСтр("ru='(не дозвонились)';en='(Not Reached)'");
		Иначе Заголовок = Заголовок + НСтр("ru='(отвеченный)';en='(Answered)'");
		КонецЕсли;	
	КонецЕсли;
	
	Заголовок = Заголовок + ", " + Объект.АбонентПредставление + ", " + Формат(Объект.Дата, "ДЛФ=D") + "/" + Формат(Объект.Дата, "ДЛФ=T; ДП=0:00:00") + "/" + Формат(сфпДлительность, "ДЛФ=T; ДП=0:00:00");
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// +CRM
#Область УчетРабочегоВремени

&НаКлиенте
Процедура Подключаемый_Команда_CRM_УказатьТрудозатраты(Команда)
	
	Подключаемый_Команда_CRM_УказатьТрудозатратыНаСервере();
	CRM_ТрудозатратыКлиент.УказатьТрудозатраты(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_CRM_ВыполнитьДействиеНадТаблицейЗаписейТрудозатраты(Команда)
	
	Подключаемый_CRM_ВыполнитьДействиеНадТаблицейЗаписейТрудозатратыНаСервере(Команда.Имя);
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_CRM_ВыполнитьДействиеНадТаблицейЗаписейТрудозатратыНаСервере(ИмяКоманды)
	
	CRM_ТрудозатратыСервер.ВыполнитьДействиеНадТаблицейЗаписейТрудозатраты(ЭтотОбъект, ИмяКоманды);
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_Команда_CRM_УказатьТрудозатратыНаСервере()
	
	CRM_ТрудозатратыСервер.УказатьТрудозатратыНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВывестиПанельТрудозатрат()
	
	CRM_ТрудозатратыКлиент.ВывестиПанельТрудозатрат(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗакрытьПанельТрудозатрат()
	
	CRM_ТрудозатратыКлиент.ЗакрытьПанельТрудозатрат(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_CRM_РабочееВремяПользователейПриИзменении(Элемент)
	
	Отказ = Ложь;
	CRM_ТрудозатратыКлиент.РабочееВремяПользователейПриИзменении(ЭтотОбъект, Элемент, Отказ);
	
	Если НЕ Отказ Тогда
		Подключаемый_CRM_РабочееВремяПользователейПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_CRM_РабочееВремяПользователейПриИзмененииНаСервере()
	
	CRM_ТрудозатратыСервер.ТаблицаЗаписейПриИзмененииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_CRM_РабочееВремяПользователейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	Подключаемый_CRM_РабочееВремяПользователейПередНачаломДобавленияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_CRM_РабочееВремяПользователейПередНачаломДобавленияНаСервере()
	
	CRM_ТрудозатратыСервер.ТаблицаЗаписейПередНачаломДобавленияНаСервере(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
// -CRM

#КонецОбласти
